var rank_data = [{
    "food1": [{
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 1],
            [5, 0]
        ],
        "total": 51,
        "img": "fire.svg",
        "name": "餐廳熱度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 1],
            [5, 0]
        ],
        "total": 34,
        "img": "smile.svg",
        "name": "好感度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "multi.svg",
        "name": "餐點多樣"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "clock.svg",
        "name": "排隊時間"
    }, {
        "rank": [
            [1, 1],
            [2, 0],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "eat.svg",
        "name": "用餐時間"
    }]
}, {
    "food2": [{
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 51,
        "img": "fire.svg",
        "name": "餐廳熱度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 1],
            [5, 0]
        ],
        "total": 34,
        "img": "smile.svg",
        "name": "好感度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "multi.svg",
        "name": "餐點多樣"
    }, {
        "rank": [
            [1, 1],
            [2, 0],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "clock.svg",
        "name": "排隊時間"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "eat.svg",
        "name": "用餐時間"
    }]
}, {
    "food3": [{
        "rank": [
            [1, 1],
            [2, 0],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 51,
        "img": "fire.svg",
        "name": "餐廳熱度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "smile.svg",
        "name": "好感度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "multi.svg",
        "name": "餐點多樣"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "clock.svg",
        "name": "排隊時間"
    }, {
        "rank": [
            [1, 1],
            [2, 0],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "eat.svg",
        "name": "用餐時間"
    }]
}, {
    "food4": [{
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 51,
        "img": "fire.svg",
        "name": "餐廳熱度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "smile.svg",
        "name": "好感度"
    }, {
        "rank": [
            [1, 1],
            [2, 0],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "multi.svg",
        "name": "餐點多樣"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "clock.svg",
        "name": "排隊時間"
    }, {
        "rank": [
            [1, 1],
            [2, 0],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "eat.svg",
        "name": "用餐時間"
    }]
}, {
    "food5": [{
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 51,
        "img": "fire.svg",
        "name": "餐廳熱度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "smile.svg",
        "name": "好感度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 1],
            [5, 0]
        ],
        "total": 35,
        "img": "multi.svg",
        "name": "餐點多樣"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "clock.svg",
        "name": "排隊時間"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "eat.svg",
        "name": "用餐時間"
    }]},{
    "food6": [{
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 51,
        "img": "fire.svg",
        "name": "餐廳熱度"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "smile.svg",
        "name": "好感度"
    }, {
        "rank": [
            [1, 1],
            [2, 0],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "multi.svg",
        "name": "餐點多樣"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 1],
            [4, 0],
            [5, 0]
        ],
        "total": 35,
        "img": "clock.svg",
        "name": "排隊時間"
    }, {
        "rank": [
            [1, 1],
            [2, 1],
            [3, 0],
            [4, 0],
            [5, 0]
        ],
        "total": 34,
        "img": "eat.svg",
        "name": "用餐時間"
    }]
}]
